questions = [
    ("Какой самый высокий горный пик в мире?", "Эверест", "Килиманджаро", "К2", "Аконкагуа", 5, "Горы мира"),
    ("Какое химическое обозначение у воды?", "H2O", "CO2", "NaCl", "HCl", 3, "Химия в повседневной жизни"),
    ("Какой год считается началом Великой Отечественной войны?", "1941", "1939", "1942", "1945", 10, "История России"),
    ("Кто написал произведение 'Преступление и наказание'?", "Федор Достоевский", "Лев Толстой", "Иван Тургенев", "Александр Пушкин", 7, "Русская литература"),
    ("Какой самый крупный океан на Земле?", "Тихий", "Атлантический", "Индийский", "Северный Ледовитый", 4, "Моря и океаны"),
    ("Сколько планет в Солнечной системе?", "8", "7", "9", "10", 6, "Космос и звезды")
]
