Ответы на задания

Задание 1. «Онбординг: первые программы»
1.1. Python применяется во всех предложенных сферах.
1.2. Правило скобок лишнее. Остальные правила соотносятся так:

Доп. 1. Верны три утверждения.

Доп. 4. Верны три утверждения.


Задание 2. «Онбординг: вывод данных»
1.1. Верны два варианта.

1.3. Правильный код программы:
	print('Создатель языка Python - Гвидо ван Россум')
print('Последняя версия языка вышла в 2019 году')
1.4. Правильный код программы:
	print("*           **********")
print("         ***            ****")
print("     ***                      ***")
print("    **                           **")
print("  **       *****     *****      **")
print(" *             **       **           **")
print(" **                                   **")
print(" **                 *                 **")
print("  **       **            ***     **")
print("   **         **       **       **")
print("    **          *****        **")
print("       **                   **")
print("        *************")
1.5.  Код программы:
	print('Hello, world!')
1.6. Код программы:
	print('Сумма зарплат сотрудников:', 53670*12)
Доп. 1. Правильный вариант ответа:
	
Доп. 2. Код программы:
	print('Стоимость аренды:')
print(85000*0.1 + 85000)
Доп. 3. Код программы:
	print('Необходимо выделить:', 55480*6 + 21830*3 + 411*11 + 290*5)
Доп. 4. Код программы:
	print('В хранилище поместится', 5000//256, 'файлов')
print('Останется', 5000%(256*19), 'Гб')


Дополнительное задание «Онбординг: доп задание»
1.1. Код программы:
	hours = 6
minutes = 42
print('По статистике в 2019 году пользователь интернета проводил в онлайне', hours, 
'часов', minutes, 'минуты ежедневно')
1.2. Код программы:
print('Месяц:', 200711%100)
print('Год:', 200711//100)

